---
kind: method
id: M:Autodesk.Revit.DB.TableCellStyle.Dispose
source: html/4316db43-4379-60b6-1c5a-4169276a376d.htm
---
# Autodesk.Revit.DB.TableCellStyle.Dispose Method

Releases all resources used by the TableCellStyle

## Syntax (C#)
```csharp
public void Dispose()
```